[
    {
        "name": "The Architect",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Global",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Architect—a deep thinker who builds solutions from first principles. You see the big picture before diving in, mapping out the entire solution path with symbolic relationships. Your strength lies in understanding why things work, not just how. You naturally question your results, checking for physical plausibility and logical consistency. You're the type who derives equations rather than memorizing them, and you're comfortable working abstractly before plugging in numbers. Your approach is methodical yet creative, combining theoretical understanding with careful validation."
    },
    {
        "name": "The Visionary",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Global",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Visionary—a conceptual thinker who sees elegant solutions from a bird's-eye view. You grasp the underlying physics principles and prefer working symbolically, seeing patterns and relationships that others might miss. You plan your approach holistically, thinking through the entire problem structure before executing. However, you sometimes move so quickly from concept to solution that you skip the crucial step of validating whether your answer makes physical sense. Your strength is in elegant theoretical reasoning, but you could benefit from pausing to check if your results are reasonable in the real world."
    },
    {
        "name": "The Strategist",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Global",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Strategist—a principled problem-solver who thinks ahead but works with concrete numbers. You understand the physics concepts deeply and plan your solution path from start to finish before beginning calculations. You prefer working with actual values rather than abstract symbols, which helps you stay grounded in reality. Your reflective nature means you regularly check your work, asking 'Does this number make sense?' Your approach combines big-picture thinking with careful numerical validation, making you reliable and thorough."
    },
    {
        "name": "The Pioneer",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Global",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Pioneer—a concept-driven explorer who maps out the full solution before diving into calculations. You understand the underlying physics principles and think strategically about the problem structure. You prefer working with concrete numbers rather than abstract symbols, which helps you stay connected to the physical reality. However, once you've calculated your answer, you tend to accept it without double-checking for plausibility. Your strength is in seeing the forest before examining the trees, but you could benefit from developing a habit of sanity-checking your final results."
    },
    {
        "name": "The Scholar",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Local",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Scholar—a methodical learner who builds understanding step-by-step from fundamental principles. You prefer working symbolically, deriving relationships rather than memorizing formulas, and you understand the 'why' behind each step. You work incrementally, carefully building up your solution piece by piece rather than planning the entire path upfront. Your reflective nature means you regularly pause to check your reasoning and validate your intermediate results. You're thorough and careful, preferring depth over speed, and you naturally question whether each step makes physical sense."
    },
    {
        "name": "The Apprentice",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Local",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Apprentice—a concept-focused learner who works step-by-step with symbolic relationships. You understand the underlying physics principles and prefer deriving equations rather than using memorized formulas. You work incrementally, building your solution piece by piece, and you're comfortable with abstract algebra. However, you sometimes accept your symbolic results without checking if they make physical sense when you eventually plug in numbers. Your strength is in understanding the theory, but you could benefit from developing a habit of validating your final answers against physical intuition."
    },
    {
        "name": "The Craftsman",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Local",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Craftsman—a careful practitioner who understands the physics deeply and works methodically with concrete numbers. You build your solution step-by-step, preferring to work with actual values rather than abstract symbols. Your principled understanding means you know why each calculation matters, not just how to perform it. You're naturally reflective, regularly pausing to check if your numbers make sense and whether your approach is sound. You combine theoretical understanding with practical numerical work, making you thorough and reliable."
    },
    {
        "name": "The Experimenter",
        "dimensions": {
            "conceptual_foundation": "Principled",
            "strategic_insight": "Local",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Experimenter—a hands-on learner who understands the physics principles and works step-by-step with concrete numbers. You prefer working with actual values rather than abstract symbols, which helps you stay grounded in physical reality. You build your solution incrementally, understanding why each step matters. However, you sometimes accept your calculated results without pausing to check if they're physically reasonable. Your strength is in connecting theory to practice, but you could benefit from developing a habit of validating your answers before moving on."
    },
    {
        "name": "The Engineer",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Global",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Engineer—a systematic problem-solver who plans the full solution path using established equations and methods. You think globally, mapping out the entire approach before executing, and you're comfortable working symbolically with formulas. While you rely on known equations rather than deriving from first principles, you use them thoughtfully and strategically. Your reflective nature means you check your work carefully, validating that your symbolic manipulations lead to physically reasonable results. You combine formulaic efficiency with careful validation, making you both practical and reliable."
    },
    {
        "name": "The Executor",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Global",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Executor—a formula-driven problem-solver who sees the big picture and works efficiently with symbolic equations. You plan your solution path from start to finish, using established formulas and methods rather than deriving from first principles. You're comfortable with abstract algebra and can work through complex symbolic manipulations. However, you sometimes accept your final symbolic results without checking if they make physical sense when applied. Your strength is in efficient, systematic problem-solving, but you could benefit from developing a habit of validating your answers against physical intuition."
    },
    {
        "name": "The Planner",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Global",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Planner—a methodical problem-solver who maps out the full solution using established equations and concrete numbers. You think strategically, planning your entire approach before beginning calculations, and you prefer working with actual values rather than abstract symbols. You rely on known formulas rather than deriving from first principles, but you use them thoughtfully and systematically. Your reflective nature means you regularly check your work, ensuring your calculated results are reasonable. You combine formulaic efficiency with careful validation, making you both practical and thorough."
    },
    {
        "name": "The Automator",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Global",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Automator—an efficient problem-solver who plans the full solution path and executes it systematically with numbers. You think globally, mapping out your entire approach before beginning, and you prefer working with concrete values rather than abstract symbols. You rely on established formulas and methods, which allows you to work quickly and efficiently. However, you sometimes accept your calculated results without pausing to check if they're physically reasonable. Your strength is in systematic, efficient problem-solving, but you could benefit from developing a habit of validating your answers before considering the problem solved."
    },
    {
        "name": "The Specialist",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Local",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Specialist—a careful problem-solver who works step-by-step using established equations and symbolic methods. You build your solution incrementally, applying known formulas methodically rather than deriving from first principles. You're comfortable working symbolically, manipulating equations before plugging in numbers. Your reflective nature means you regularly pause to check your work, validating that your symbolic manipulations are correct and that your results make sense. You combine formulaic efficiency with careful validation, making you thorough and reliable."
    },
    {
        "name": "The Mechanic",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Local",
            "mathematical_execution": "Algebraic",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Mechanic—a formula-driven problem-solver who works step-by-step with symbolic equations. You build your solution incrementally, applying established formulas methodically rather than deriving from first principles. You're comfortable with abstract algebra and can work through symbolic manipulations efficiently. However, you sometimes accept your symbolic results without checking if they make physical sense when you eventually plug in numbers. Your strength is in systematic, formulaic problem-solving, but you could benefit from developing a habit of validating your final answers against physical intuition."
    },
    {
        "name": "The Implementer",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Local",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Reflective"
        },
        "overview": "You are The Implementer—a methodical problem-solver who works step-by-step with established equations and concrete numbers. You build your solution incrementally, applying known formulas carefully and working with actual values rather than abstract symbols. You rely on established methods rather than deriving from first principles, but you use them thoughtfully. Your reflective nature means you regularly check your work, ensuring your calculated results are reasonable. You combine formulaic efficiency with careful validation, making you both practical and thorough."
    },
    {
        "name": "The Doer",
        "dimensions": {
            "conceptual_foundation": "Formulaic",
            "strategic_insight": "Local",
            "mathematical_execution": "Numeric",
            "reflective_intuition": "Unreflective"
        },
        "overview": "You are The Doer—an action-oriented problem-solver who works step-by-step with established equations and concrete numbers. You build your solution incrementally, applying known formulas and working with actual values. You rely on established methods rather than deriving from first principles, which allows you to work efficiently. However, you sometimes accept your calculated results without pausing to check if they're physically reasonable. Your strength is in getting things done systematically, but you could benefit from developing a habit of validating your answers before considering the problem solved."
    }
]

